<HTML>

<HEAD>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <meta http-equiv="Content-Style-Type" content="text/css">
  <META NAME="author" CONTENT="Ralf Greve">
  <meta name="content-language" content="en">
  <meta name="robots" content="index,follow">
  <TITLE>Greve (2003)</TITLE>
  <link href="../../../styles/ralf_style.css" rel="stylesheet" type="text/css">
</HEAD>

<BODY>

<p><img src="../../../pictures/spacer_transparent_1x1.gif"
        alt="Spacer" width="1" height="10"></p>

<table align="center" cellpadding="25" cellspacing="0"
       bgcolor="#ffffff" width=750>
<tr><td>

<H1 style="margin-top:0px; margin-bottom:0px; color:#000000;">
Kontinuumsmechanik</H1>

<H2 style="margin-top:0px; color:#000000;">
Ein Grundkurs f&uuml;r Ingenieure und Physiker</H2>

<P>Ralf GREVE</P>

<hr>

<H4 style="color:#000000;">Vorwort</H4>

<P>Das vorliegende Buch ist aus dem Skript zu einer zweisemestrigen
Vorlesung &uuml;ber Kontinuumsmechanik entstanden, die ich seit 1995
an der Technischen Universit&auml;t Darmstadt halte. Es richtet sich
an Studenten und Studentinnen der Physik, Mechanik, Ingenieur- und
Geowissenschaften aller Richtungen sowie der angewandten Mathematik im
Hauptstudium. F&uuml;r Mechaniker und Ingenieure stellt die
Kontinuumsmechanik eine sinnvolle Erg&auml;nzung zu dem Kurs &uuml;ber
technische Mechanik im Grundstudium dar, welche es erm&ouml;glicht,
die vielen unterschiedlichen Aspekte der technischen Mechanik in einem
gr&ouml;&szlig;eren, &uuml;bergeordneten Zusammenhang zu sehen.
Jedoch ist die Kenntnis der technischen Mechanik keine Voraussetzung
zum Verst&auml;ndnis des Stoffes, was auch Physikern,
Geowissenschaftlern und Mathematikern den Zugang dazu
erm&ouml;glicht. Speziell f&uuml;r Physiker, deren &uuml;bliche
Ausbildung in klassischer Mechanik sich nach meiner Erfahrung (ich
z&auml;hle mich selbst zu dieser Spezies) in der Regel auf die
Mechanik von Punkten, Punktsystemen und starren K&ouml;rpern
beschr&auml;nkt, ist die Kontinuumsmechanik als klassische Feldtheorie
der deformierbaren K&ouml;rper eine interessante Erg&auml;nzung zu den
Feldtheorien der Elektrodynamik und Quantenmechanik, auch im Hinblick
auf m&ouml;gliche ingenieurnahe Bet&auml;tigungsgebiete.</P>

<P>Der einf&uuml;hrende Charakter des Buches bringt es mit sich, dass
kein Anspruch auf eine umfassende Behandlung aller Aspekte der
Kontinuumsmechanik erhoben wird.  Statt dessen ist die Zielsetzung,
die wesentlichen Ideen und Konzepte der modernen Kontinuumsmechanik
klar, verst&auml;ndlich und ohne allzu fortgeschrittene Mathematik
darzustellen. Weiterhin wird in den zwei eher anwendungsorientierten
Kapiteln &uuml;ber lineare Elastizit&auml;t und Hydrodynamik die
direkte Verbindung zum Stoff der technischen Mechanik
hergestellt. F&uuml;r weiter f&uuml;hrende Abhandlungen &uuml;ber die
Kontinuumsmechanik m&ouml;chte ich auf die umfangreiche Literatur
verweisen. Um die h&auml;ufig englischsprachigen Werke dem Leser und
der Leserin leichter zug&auml;nglich zu machen, habe ich diesem Buch
eine Liste der wichtigsten englischen Fachausdr&uuml;cke
beigef&uuml;gt.</P>

<P>Notwendige Voraussetzungen zum Verst&auml;ndnis des Stoffes
beschr&auml;nken sich auf grundlegende Kenntnisse der ein- und
mehrdimensionalen Analysis, linearen Algebra und elementaren
Newtonschen Mechanik.  Dar&uuml;ber hinaus gehende mathematische
Konzepte, speziell Tensorrechnung und Tensoranalysis, werden auf das
Notwendige beschr&auml;nkt und im Text erkl&auml;rt. Aus Gr&uuml;nden
der &Uuml;bersichtlichkeit der Darstellung habe ich bei Rechnungen in
Indexnotation davon abgesehen, diese in allgemeinen krummlinigen
Koordinaten durchzuf&uuml;hren. Dies stellt keinen Verlust an
Allgemeinheit dar, denn die kartesische Indexnotation kann jederzeit
in die symbolische Notation &uuml;bersetzt und dann auf krummlinige
Koordinatensysteme angewendet werden.</P>

<P>Die gestellten Probleme sind ein integraler Bestandteil des Stoffes
und daher im Unterschied zur g&auml;ngigen Praxis bewusst in den
laufenden Text eingef&uuml;gt. Sie stellen ein Angebot an den Leser
und die Leserin dar, sich selbst aktiv mit Papier und Bleistift mit
der Materie auseinanderzusetzen, um so ein fundierteres
Verst&auml;ndnis zu erlangen, als es durch reine Lekt&uuml;re
m&ouml;glich ist. Einige Probleme sind kurz und unkompliziert
gehalten, einige jedoch auch l&auml;nger und aufw&auml;ndiger.  Dies
ist als Anreiz und nicht etwa als Abschreckung gemeint, gelegentliches
"Spicken" in den L&ouml;sungsweg ist dabei durchaus legitim und im
Sinne des Erfinders.</P>

<P>Herzlich danken m&ouml;chte ich an dieser Stelle Herrn Dr. Yongqi
Wang und Herrn Dr. Dimitri Ktitarev, die mich beim Durchf&uuml;hren
der vorlesungsbegleitenden &Uuml;bungen mit gro&szlig;em Einsatz
unterst&uuml;tzt und dadurch zu den im Text gestellten und
durchgerechneten Problemen beigetragen haben. Desweiteren gilt mein
Dank den zahlreichen Studenten und Studentinnen, die sich f&uuml;r die
Kontinuumsmechanik interessieren konnten, und deren Fragen und
Bemerkungen Eingang in die Gestaltung dieses Buches gefunden
haben. Einen speziellen Dank m&ouml;chte ich schlie&szlig;lich meinem
Lehrer und Doktorvater, Herrn Prof. Kolumban Hutter, aussprechen. Von
ihm bin ich in die Ideen und Methoden der modernen Kontinuumsmechanik
und Thermodynamik eingef&uuml;hrt worden, und er hat mich &uuml;ber
Jahre hinweg mit gro&szlig;em Einsatz auf meinem akademischen
Werdegang begleitet. Es ist mir ein Anliegen und eine gro&szlig;e
Freude, ihm dieses Buch zu widmen.</P>

<P>Darmstadt, im Januar 2003</P>

<P>Ralf Greve </P>

<hr>

<P>Springer, Berlin, Germany etc., 302&nbsp;pp. (2003).
ISBN: 3-540-00760-1.</P>

</td></tr>
</table>

<table align="center" cellpadding="0" cellspacing="0"
       width=750>
<tr><td>

<p>&nbsp;<br><i>Last modified: 2008-09-05</i><br>&nbsp;</p>

</td></tr>
</table>

</BODY>

</HTML>
